export const ARDUINO_PROGRAMMING_LABS = [
  {
    lab: "Лабораторна робота 1",
    tasks: [
      "Завдання 1. Миготливий світлодіод на Arduino.",
      "Завдання 2. Маячок з наростаючою яскравістю.",
      "Завдання 3. Світильник з керованою яскравістю.",
      "Завдання 4. Кнопка та її використання.",
      "Завдання 5. Кнопка, що включає та виключає діод.",
      "Завдання 6. RGB світлодіод.",
      "Завдання 7. Залізничний світлофор.",
      "Завдання 8. Автомобільний світлофор (3 секції)."
    ]
  },
  {
    lab: "Лабораторна робота 2",
    tasks: [
      "Завдання 9. Побудувати пристрій, який передає сигнал SOS за допомогою азбуки Морзе.",
      "Завдання 10. Датчик звуку KY-037. Включення діода з хлопка.",
      "Завдання 11. Включення діодів по голосу. Bluetooth та Arduino і використання Android аплікацій.",
      "Завдання 12. Фоторезистор. Побудова детектора руху. Використання Matlab та Arduino.",
      "Завдання 13. PIR датчик руху та використання Python для керування Arduino.",
      "Завдання 14. Датчик температури.",
      "Завдання 15. Датчик температури та вологості."
    ]
  },
  {
    lab: "Лабораторна робота 3",
    tasks: [
      "Завдання 16. Датчик рівня води.",
      "Завдання 17. Лазерний датчик.",
      "Завдання 18. Пьезоелемент. Сигналізація.",
      "Завдання 19. Терменвокс.",
      "Завдання 20. СD рідер, логирование даних на картку.",
      "Завдання 21. Ультразвуковий датчик відстані HC-SR04.",
      "Завдання 22. Сервопривод, потенціомерт і джойстик.",
      "Завдання 23. Джойстик і RGB-світлодіод.",
      "Завдання 24. Радар та візуалізація даних Matlab та Python."
    ]
  },
  {
    lab: "Лабораторна робота 4",
    tasks: [
      "Завдання 25. Семісегментний індикатор.",
      "Завдання 26. Лічильник натискань. Здвіговий регістр.",
      "Завдання 27. Семісегментний чотирьох розрядній індикатор.",
      "Завдання 28. Мікросхема зсувного регістру 74НС595. Управляємо матрицею з 4 розрядів, економимо виходи Arduino.",
      "Завдання 29. LCD дисплеї. Підключення. Вивід значень з датчиків."
    ]
  },
  {
    lab: "Лабораторна робота 5",
    tasks: [
      "Завдання 30. Світлодіодна матриця 8x8. Виведення символів.",
      "Завдання 31. Світлодіодна матриця. Рядок, що біжить.",
      "Завдання 32. Підключення матричної клавіатури.",
      "Завдання 33. RFID."
    ]
  }
];
